IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC-INTERES-LEGACY.
       AUTHOR. SISTEMAS-ANTIGUOS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PRESTAMO    PIC 9(9)V99 VALUE 5000.00.
       01 WS-TASA        PIC 9(2)V99 VALUE 05.50.
       01 WS-TIEMPO      PIC 9(2)    VALUE 12.
       01 WS-TOTAL       PIC 9(9)V99.

       PROCEDURE DIVISION.
           COMPUTE WS-TOTAL = (WS-PRESTAMO * WS-TASA * WS-TIEMPO) / 100.
           DISPLAY "RESULTADO LEGACY: " WS-TOTAL.
           STOP RUN.